/*************************************************************************
	> File Name: oj100.c
	> Author: 
	> Mail: 
	> Created Time: Mon 26 Oct 2020 06:53:46 PM CST
	假设你每个月向银行账户存 100 美元，月利率为 0.00417。​ 第一个月之后，账户上的值就变成：​ 100∗(1+0.00417)=100.417
​ 第二个月之后，账户上的值就变成：​ (100+100.417)∗(1+0.00417)=201.252
​ 第三个月之后，账户上的值就变成：​ (100+201.252)∗(1+0.00417)=302.507
​ 以此类推。​ 编写程序显示六个月后账户上的钱数。
 ************************************************************************/

#include<stdio.h>
#define EP 0.00417

int main() {
	int n, month = 6;
	scanf("%d", &n);
	double temp = 0.0;
	while ( month -- ) {
		temp = n + temp + (temp + n ) * EP; 
	}
	printf("$%.2lf\n", temp);
}
