/*************************************************************************
	> File Name: oj130.c
	> Author: 
	> Mail: 
	> Created Time: Wed 28 Oct 2020 03:48:26 PM CST
	假设你每个月向银行账户存 100 美元，月利率为 0.00417。第一个月之后，账户上的值就变成：100∗(1+0.00417)=100.417
第二个月之后，账户上的值就变成：(100+100.417)∗(1+0.00417)=201.252
第三个月之后，账户上的值就变成：(100+201.252)∗(1+0.00417)=302.507
以此类推。编写程序显示 n个月后账户上的钱数。
 ************************************************************************/

#include<stdio.h>

int main() {
	int m, n;
	double temp = 0;
	scanf("%d%d", &m, &n);
	while (n--) {
		temp = (temp + m) * (1 + 0.00417); 
	}
	printf("$%.2lf\n", temp);
	return 0;
}
