/*************************************************************************
	> File Name: oj69.c
	> Author: 
	> Mail: 
	> Created Time: Mon 26 Oct 2020 11:29:07 AM CST
	给出一个日期，请判断日期的合法性。特别注意一下几点：
年份是负数时，代表公元前，是合法的
月份和日子是负数是非法的
2月份要注意判断闰年的情况，闰年的判断标准是：能被4整除但不能被100整除，或者能被400整除
 ************************************************************************/

#include<stdio.h>
int arr[13] = {0,31,28,31,30,31,30,31,31,30,31,30,31};

int check(int y, int m, int d) {
	if (m <=0 || m >12 || d <=0) return 0;
	if ( (y % 4 ==0 && y % 100 != 0) || y %400 == 0 ) {
		arr[2] = 29;
	}
	return d <= arr[m];
}

int main() {
	int y, m, d;
	scanf("%d%d%d",&y, &m, &d);
	check(y, m ,d) ? printf("Yes\n") : printf("No\n");

	return 0;
}
