/*************************************************************************
	> File Name: oj98.c
	> Author: 
	> Mail: 
	> Created Time: Mon 26 Oct 2020 06:40:51 PM CST
	 输入两个个实数 r 和 h 分别表示圆柱体的底面半径和高，你需要计算圆柱体的体积。​ 公式如下：​
底面积=半径∗半径∗π
​
体积=底面积∗高
​ 其中，π 取 3.14​
 ************************************************************************/

#include<stdio.h>
#define PI 3.14

int main() {
	double r, h;
	scanf("%lf%lf", &r, &h);
	printf("%.2lf\n", r * r * PI);
	printf("%.2lf\n", PI * r * r * h);
	return 0;
}
